app/controllers/companies_controller.rb

SELECT * FROM `companies` ORDER BY name LIMIT 0, 15
---
   def store
      if params[:id] == "grid"
        list = []
        if session_user.id == 1
            conditions = ""
            conditions = ["name LIKE ?", "%#{params[:query]}%"] if params[:query]
        else
            conditions = "id in (select customer_id from projects p, users_projects u where p.id = u.project_id and u.user_id = "+session_user.id.to_s+" UNION select network_owner_id from projects p, users_projects u where p.id = u.project_id and u.user_id = "+session_user.id.to_s+")"
            conditions = ["id in (select customer_id from projects p, users_projects u where p.id = u.project_id and u.user_id = "+session_user.id.to_s+" UNION select network_owner_id from projects p, users_projects u where p.id = u.project_id and u.user_id = "+session_user.id.to_s+") and name LIKE ?", "%#{params[:query]}%"] if params[:query]
        end
        companies = Company.all(
                                :conditions => conditions,
                                :limit => params[:limit],
                                :offset => params[:start],
                                :order => "name"
                        )

SELECT * FROM `companies`
---
  def index
    @companies = Company.all