app/controllers/login_controller.rb

  def authenticate
    session[:user_id] = nil
    if request.post?
      user = User.authenticate(params[:login], params[:password])
      if user
        roles = []
        session[:user_id] = user.id
        user.users_projects.each do |p|
---
SELECT * FROM `users` WHERE (`users`.`login` = 'admin') LIMIT 1